/* самое важное в JS это : выражения , функции , объекты !!!

Главая идея в JS это то , что практически все сущности - объэкты !!! 

ОБЪЕКТ - это набор свойств "имя: значение" (имя часто называют ключами)

Пример объекта :

{
    visible: true,
    colorDepth: 24,
    title: 'My Image',
    orientation: {                  пример вложенного объекта !!! (orientation)
        angle: 0,                   
        type: 'landscape'
    },
    pixelDepth: 24,
    width: 1440
}

МАССИВ - это объект !!!
ФУНКЦИЯ - это объект !!!
ЧИСЛО - это объект !!! (только ведет себя как объект)
СТРОКА - это объект !!! (только ведет себя как объект)


*/