/*
-----------------------------------------------------------
Функции

Это блок кода , который можно выполнять многократно !!!
Пример :

let a = 5                                         
let b = 3                                                                        
let c                                                                      
c = a + b
console.log(c) - 8
                        одинаковые блоки кода (нужно оптимизировать! смотреть внизу)            
let a = 8
let b = 12
let c
c = a + b
console.log(c) - 20

ОПТИМИЗАЦИЯ

let a = 5
let b = 3
function sum(a, b) {
    const c = a + b
    console.log(c)
}

sum(a, b) - 8

a = 8
b = 12
sum(a, b) - 20

ФУНКЦИЯ МОЖЕТ БЫТЬ ...
1.именованной
2.присвоенна переменной
3.анонимной
4.аргументом при вызове другой функции
5.значением свойства (метода) объекта

ФУНКЦИЯ ЭТО ОБЪЕКТ !!!

-----------------------------------------------------------
*/