/*
----------------------------------------------------
СТРОГИЙ РЕЖИМ -- USE STRICT

'use strict' - это инструкция js , чтобы анализировать мой код более пристольно !!!

Пример : 

'use strict'

function myFn() {
    a = true -- ERROR (запрещает использование необъявленных переменных)
    console.log(a)
}
myFn()
console.log(a)
----------------------------------------------------
ОПЕРАТОРЫ

Операторы - это встроенная в JS функция ! 

Бывают : 

Арифметические (+, -, *, /)
Сравнения (===, !==, <=, >=)
Логические (!, &&, ||)
Присваивание (=)

Еще бывают 

Текстовые (typeof, instanceof, new, delete)
----------------------------------------------------

*/