/* 
Что такое console.log ?

console - это объект
log - метод
(...) - вызов метода
'Hello World' - аргумент (значение типа "String")

Так же существуют другие :

console.dir() - отображает все свойства объекта.

console.table() - отображает все свойства объекта в табличном виде.

Пример:

console.log('Daniel')
Daniel - то что передал console
undefined - значение функции log - результат который вернула функция log
------------------------------------------------------------------------
Выражения 

Любое выражение всегда возвращает значение !!! 

Примеры:

"abc"
5 + 2
c = 10
myFunction(c, d)
------------------------------------------------------------------------
Переменные

Они дают возможность повторного доступа к значениям

Имена переменных:

1) PascalCase (типы и классы), для именования типов и классов;

2) DB_PASSWORD - значения известны до запуска приложения и не меняются (типо константы);

3) camelCase - все остальные случаи; 


И самое главное - НАЗВАНИЯ ПЕРЕМЕННЫХ ДОЛЖНЫ БЫТЬ ПОНЯТНЫМИ !!!
*/